* Station Centrale
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | StationCentrale
Place Name                       | Station Centrale
Geographic Location              | Northwest Greenland
Ice Type                         | Ice sheet
Data Reference                   | Heuberger, J.-C. 1954. Expéditions Polaires Françaises: Missions Paul-Emil Victor. Glaciologie Groenland Volume 1: Forages sur l'inlandsis. Hermann & Cle, Éditeurs. Paris.
Data DOI                         | 
Science Reference                | Heuberger, J.-C. 1954. Expéditions Polaires Françaises: Missions Paul-Emil Victor. Glaciologie Groenland Volume 1: Forages sur l'inlandsis. Hermann & Cle, Éditeurs. Paris.
Science DOI                      | 
Date                             | 
Longitude [°E]                   | 
Latitude [°N]                    | 
Location source                  | 
Depth of top measurement [m]     | 10.0
Depth of bottom measurement [m]  | 150
Ice thickness [m]                | 
Coverage [% of thickness]        | #DIV/0!
Ice thickness source             | 
General_Note                     | 
Temperature_note                 | https://github.com/GEUS-Glaciology-and-Climate/greenland_ice_borehole_temperature_profiles/files/7082104/heuberger_1954.pdf
Thickness_note                   | 
Location_note                    | 
#+end_example


** Temperature

+ Table 31.2 from [[https://github.com/GEUS-Glaciology-and-Climate/greenland_ice_borehole_temperature_profiles/files/7082104/heuberger_1954.pdf][Heuberger (1954)]]
+ We use only Thermistor No 16

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|   d |      t |
|  10 | -27.35 |
|  15 | -27.04 |
|  17 |  -27.0 |
|  18 | -27.03 |
|  20 | -26.98 |
|  25 | -27.05 |
|  30 | -27.12 |
|  35 | -27.27 |
|  40 |  -27.3 |
|  45 |  -27.4 |
|  50 | -27.46 |
|  55 | -27.52 |
|  60 | -27.55 |
|  65 |  -27.6 |
|  70 | -27.65 |
|  75 | -27.68 |
|  80 |  -27.7 |
|  85 | -27.72 |
|  90 | -27.73 |
|  95 | -27.75 |
| 100 | -27.76 |
| 105 | -27.77 |
| 110 | -27.77 |
| 115 | -27.78 |
| 120 | -27.78 |
| 125 | -27.78 |
| 130 | -27.78 |
| 135 | -27.78 |
| 140 | -27.78 |
| 145 | -27.78 |
| 150 | -27.78 |


